运算符:
	1、赋值运算符
		=   
		+= 、 -= 、*= 、/= 、%= 
		a+=b ---> a = a + b 
		
	2、算数运算符
		+ - * / %  ++  --
			
			+   两边如果是基本数据类型，起加法运算
				两或者任意一边是引用数据类型，则起连作用
	3、逻辑运算符
		&   |  !   ^   &&   ||
		
		注意点:
			布尔类型表达式1  &&  布尔类型表达式2 
			布尔类型表达式1  ||  布尔类型表达式2 
	4、比较运算符
		>  <  >=  <=  !=  ==
		注意点 ： ==   
			两边如果是基本数据类型，比较的是值的大小
			两边如果是引用数据类型，比较的是内存地址
	
	5、三目运算符
		
			布尔类型表达式 ?  表达式1  : 表达式2  ;
			
	6、按位运算符
		&  |  ^  <<  >>(带符号右移)  >>>(无符号右移)
		数值先转为二进制的1和0
		1在二进制中表示 '开'  true
		0在二进制中表示 '关'  false
		
		1 & 0  0
		1 | 0  1
		1 ^ 0  1
		
		>> 和 >>>的区别：
			
			正整数的 >> 和 >>> 没有区别，因为高位都是补0 
			
			负整数的 >>  和 >>> 区别是:
				>>  高位补1
				>>> 高位还是补0
		
		
			
			