/*
	*****
	java中的数据类型 ：
		1、基本数据类型
		2、引用数据类型
	
	一、基本数据类型   四类八种
			
		1、整数类型 			 占内存大小			取值范围
			byte	字节型       1字节8位			-128  --- 127
			short	短整型		 2字节16位
			int		整型		 4字节32位
			long	长整型       8字节64位
			
		2、浮点类型
			float   单精度		 4字节32位
			double  双精度       8字节64位
			
		3、字符类型
			char				 2字节16位
			
		4、布尔类型
			boolean	 该类型比较特殊，值只有两: true 、 false
			
	*****
	声明变量
		语法:
			数据类型  变量  =  值 ;
			
			int  number = 10 ;
			
			char c = 'a' ;
			
			boolean b = true ;
*/

