java中有三种注释:
	注释:
		注释的作用是解释代码
		注释中的内容，不会运行
		

	1、单行注释    // 注释内容.......
	
	2、多行注释
		/*		
			注释内容.....
			注释内容.....			
		*/
		
		
		
	3、文档注释 --- 也归属于多行注释
		/**

			注释内容
			给方法加注释的
		*/
	
	注意点: 多行注释中不允许再出现多行注释
		


/*
	java中的关键字、保留字
	
		关键字: sun公司开发人员在开发java时，规定的具有特殊含义的字符序列
			
			关键字特点:
				1、全都是小写的
				2、具有特殊颜色
	
	保留字: goto
		
*/


/*
	***
	java中的标识符:
		标识符就是在代码编写过程中
		自己起的变量、方法名、类名、接口名、数组名等等 
		简而言之，只要是自己起的名称，都是标识符
		
		****
		起名规则:
			1、标识符只能由 字母、数字、下划线_ 、美元符号$ 组成
			2、标识符不能以数字开头
			3、标识符不能是关键字、保留字
		
		标识符理论上没有长度限制，但最好是见名知意
*/